pandoc-md2html/links.org
#+TITLE: links
#+AUTHOR: Karthik
#+SETUPFILE: ~/mynotes/org2html/org-theme-collection/theme2.setup
* Convert markdown to pdf 
https://github.com/Wandmalfarbe/pandoc-latex-template

clean pandoc LaTeX template to convert your markdown files to PDF or LaTeX. It is designed for lecture notes and exercises with a focus on computer science. The template is compatible with pandoc 2.




https://github.com/prosegrinder/pandoc-templates
An opinionated set of Pandoc templates and scripts for converting markdown to DOCX manuscripts 


* Template info
https://pandoc.org/MANUAL.html#templates
Templates

When the -s/--standalone option is used, pandoc uses a template to add header and footer material that is needed for a self-standing document. To see the default template that is used, just type

pandoc -D *FORMAT*

where FORMAT is the name of the output format. A custom template can be specified using the --template option. You can also override the system default templates for a given output format FORMAT by putting a file templates/default.*FORMAT* in the user data directory (see --data-dir, above). Exceptions:

    For odt output, customize the default.opendocument template.
    For pdf output, customize the default.latex template (or the default.context template, if you use -t context, or the default.ms template, if you use -t ms, or the default.html template, if you use -t html).
    docx and pptx have no template (however, you can use --reference-doc to customize the output).

Templates contain variables, which allow for the inclusion of arbitrary information at any point in the file. They may be set at the command line using the -V/--variable option. If a variable is not set, pandoc will look for the key in the document’s metadata, which can be set using either YAML metadata blocks or with the -M/--metadata option. In addition, some variables are given default values by pandoc. See Variables below for a list of variables used in pandoc’s default templates.

If you use custom templates, you may need to revise them as pandoc changes. We recommend tracking the changes in the default templates, and modifying your custom templates accordingly. An easy way to do this is to fork the pandoc-templates repository and merge in changes after each pandoc release.

* Convert markdown to github css style
https://gist.github.com/dashed/6714393
https://gist.github.com/dashed/6714393#file-github-pandoc-css



* convert org to markdown


https://github.com/larstvei/ox-gfm

Github Flavored Markdown exporter for Org Mode
You can install ox-gfm using elpa. It's available on melpa:

M-x package-install ox-gfm 


https://orgmode.org/worg/org-8.0.html#sec-6-1

ox-backend-*. For example:

    org-html-* for HTML and live in ox-html.el
    org-latex-* for LaTeX and live in ox-latex.el

* Create a website from markdown stored in google drive 
https://stackoverflow.com/questions/30576469/reading-markdown-from-a-file-hosted-in-google-docs


* Django Markdown Tutorial - A Simple Blog Example | Django/Python
https://www.youtube.com/watch?v=t61nTi0lIlk

* VSCode Python Data Science Setup, Part 11: Markdown to (html, pdf ) extensions 
https://www.youtube.com/watch?v=galkO3t_1Og



* #####################################################################
* host web-site using [static html file] in google-drive  [[https://www.youtube.com/watch?v=m3TXRxqiGvw][link]]
The web-site hosted will we public can't be private 
https://www.youtube.com/watch?v=m3TXRxqiGvw
https://stackoverflow.com/questions/30576469/reading-markdown-from-a-file-hosted-in-google-docs
* Django Markdown Tutorial - A Simple Blog Example | Django/Python
https://www.youtube.com/watch?v=t61nTi0lIlk

* Using pandoc to convert Markdown to HTML
https://www.youtube.com/watch?v=sZBmoiFTJVY
