pandoc-md2html/links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>links</title>
<meta name="author" content="Karthik" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">links</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8faa504">Convert markdown to pdf</a></li>
<li><a href="#org97d46ae">Template info</a></li>
<li><a href="#org4d4af09">Convert markdown to github css style</a></li>
<li><a href="#orge52b922">convert org to markdown</a></li>
<li><a href="#org27d0c25">Create a website from markdown stored in google drive</a></li>
<li><a href="#org303ee21">Django Markdown Tutorial - A Simple Blog Example | Django/Python</a></li>
<li><a href="#org4523e54">VSCode Python Data Science Setup, Part 11: Markdown to (html, pdf ) extensions</a></li>
<li><a href="#org3c989c3">#####################################################################</a></li>
<li><a href="#org5c3fcbd">host web-site using [static html file] in google-drive  link</a></li>
<li><a href="#org5e5da80">Django Markdown Tutorial - A Simple Blog Example | Django/Python</a></li>
<li><a href="#orgd7b640c">Using pandoc to convert Markdown to HTML</a></li>
<li><a href="#org2c45313">Test codeblock for org2html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8faa504" class="outline-2">
<h2 id="org8faa504">Convert markdown to pdf</h2>
<div class="outline-text-2" id="text-org8faa504">
<p>
<a href="https://github.com/Wandmalfarbe/pandoc-latex-template">https://github.com/Wandmalfarbe/pandoc-latex-template</a>
</p>

<p>
clean pandoc LaTeX template to convert your markdown files to PDF or LaTeX. It is designed for lecture notes and exercises with a focus on computer science. The template is compatible with pandoc 2.
</p>




<p>
<a href="https://github.com/prosegrinder/pandoc-templates">https://github.com/prosegrinder/pandoc-templates</a>
An opinionated set of Pandoc templates and scripts for converting markdown to DOCX manuscripts 
</p>
</div>
</div>


<div id="outline-container-org97d46ae" class="outline-2">
<h2 id="org97d46ae">Template info</h2>
<div class="outline-text-2" id="text-org97d46ae">
<p>
<a href="https://pandoc.org/MANUAL.html#templates">https://pandoc.org/MANUAL.html#templates</a>
Templates
</p>

<p>
When the -s/&#x2013;standalone option is used, pandoc uses a template to add header and footer material that is needed for a self-standing document. To see the default template that is used, just type
</p>

<p>
pandoc -D <b>FORMAT</b>
</p>

<p>
where FORMAT is the name of the output format. A custom template can be specified using the &#x2013;template option. You can also override the system default templates for a given output format FORMAT by putting a file templates/default.*FORMAT* in the user data directory (see &#x2013;data-dir, above). Exceptions:
</p>

<p>
For odt output, customize the default.opendocument template.
For pdf output, customize the default.latex template (or the default.context template, if you use -t context, or the default.ms template, if you use -t ms, or the default.html template, if you use -t html).
docx and pptx have no template (however, you can use &#x2013;reference-doc to customize the output).
</p>

<p>
Templates contain variables, which allow for the inclusion of arbitrary information at any point in the file. They may be set at the command line using the -V/&#x2013;variable option. If a variable is not set, pandoc will look for the key in the document’s metadata, which can be set using either YAML metadata blocks or with the -M/&#x2013;metadata option. In addition, some variables are given default values by pandoc. See Variables below for a list of variables used in pandoc’s default templates.
</p>

<p>
If you use custom templates, you may need to revise them as pandoc changes. We recommend tracking the changes in the default templates, and modifying your custom templates accordingly. An easy way to do this is to fork the pandoc-templates repository and merge in changes after each pandoc release.
</p>
</div>
</div>

<div id="outline-container-org4d4af09" class="outline-2">
<h2 id="org4d4af09">Convert markdown to github css style</h2>
<div class="outline-text-2" id="text-org4d4af09">
<p>
<a href="https://gist.github.com/dashed/6714393">https://gist.github.com/dashed/6714393</a>
<a href="https://gist.github.com/dashed/6714393#file-github-pandoc-css">https://gist.github.com/dashed/6714393#file-github-pandoc-css</a>
</p>
</div>
</div>



<div id="outline-container-orge52b922" class="outline-2">
<h2 id="orge52b922">convert org to markdown</h2>
<div class="outline-text-2" id="text-orge52b922">
<p>
<a href="https://github.com/larstvei/ox-gfm">https://github.com/larstvei/ox-gfm</a>
</p>

<p>
Github Flavored Markdown exporter for Org Mode
You can install ox-gfm using elpa. It's available on melpa:
</p>

<p>
M-x package-install ox-gfm 
</p>


<p>
<a href="https://orgmode.org/worg/org-8.0.html#sec-6-1">https://orgmode.org/worg/org-8.0.html#sec-6-1</a>
</p>

<p>
ox-backend-*. For example:
</p>

<p>
org-html-* for HTML and live in ox-html.el
org-latex-* for LaTeX and live in ox-latex.el
</p>
</div>
</div>

<div id="outline-container-org27d0c25" class="outline-2">
<h2 id="org27d0c25">Create a website from markdown stored in google drive</h2>
<div class="outline-text-2" id="text-org27d0c25">
<p>
<a href="https://stackoverflow.com/questions/30576469/reading-markdown-from-a-file-hosted-in-google-docs">https://stackoverflow.com/questions/30576469/reading-markdown-from-a-file-hosted-in-google-docs</a>
</p>
</div>
</div>


<div id="outline-container-org303ee21" class="outline-2">
<h2 id="org303ee21">Django Markdown Tutorial - A Simple Blog Example | Django/Python</h2>
<div class="outline-text-2" id="text-org303ee21">
<p>
<a href="https://www.youtube.com/watch?v=t61nTi0lIlk">https://www.youtube.com/watch?v=t61nTi0lIlk</a>
</p>
</div>
</div>

<div id="outline-container-org4523e54" class="outline-2">
<h2 id="org4523e54">VSCode Python Data Science Setup, Part 11: Markdown to (html, pdf ) extensions</h2>
<div class="outline-text-2" id="text-org4523e54">
<p>
<a href="https://www.youtube.com/watch?v=galkO3t_1Og">https://www.youtube.com/watch?v=galkO3t_1Og</a>
</p>
</div>
</div>



<div id="outline-container-org3c989c3" class="outline-2">
<h2 id="org3c989c3">#####################################################################</h2>
</div>
<div id="outline-container-org5c3fcbd" class="outline-2">
<h2 id="org5c3fcbd">host web-site using [static html file] in google-drive  <a href="https://www.youtube.com/watch?v=m3TXRxqiGvw">link</a></h2>
<div class="outline-text-2" id="text-org5c3fcbd">
<p>
The web-site hosted will we public can't be private 
<a href="https://www.youtube.com/watch?v=m3TXRxqiGvw">https://www.youtube.com/watch?v=m3TXRxqiGvw</a>
<a href="https://stackoverflow.com/questions/30576469/reading-markdown-from-a-file-hosted-in-google-docs">https://stackoverflow.com/questions/30576469/reading-markdown-from-a-file-hosted-in-google-docs</a>
</p>
</div>
</div>
<div id="outline-container-org5e5da80" class="outline-2">
<h2 id="org5e5da80">Django Markdown Tutorial - A Simple Blog Example | Django/Python</h2>
<div class="outline-text-2" id="text-org5e5da80">
<p>
<a href="https://www.youtube.com/watch?v=t61nTi0lIlk">https://www.youtube.com/watch?v=t61nTi0lIlk</a>
</p>
</div>
</div>

<div id="outline-container-orgd7b640c" class="outline-2">
<h2 id="orgd7b640c">Using pandoc to convert Markdown to HTML</h2>
<div class="outline-text-2" id="text-orgd7b640c">
<p>
<a href="https://www.youtube.com/watch?v=sZBmoiFTJVY">https://www.youtube.com/watch?v=sZBmoiFTJVY</a>
</p>
</div>
</div>
